#변수를 이용한 데이터프레임 생성 (효율적)
name <- c("단군왕검","주몽","대조영","왕건","이성계")
kor <-c(98,89,100,78,69)
math <- c(88,96,99,88,100)
eng <- c(78,88,68,88,99)
df2_2 <- data.frame(name, kor, math, eng)
df2_2

#변수와 데이터를 이용한 데이터프레임 생성
df2_3<-data.frame(name=c("단군왕검","주몽","대조영","왕건","이성계"), 
        kor = c(98,89,100,78,69),math = c(88,96,99,88,100),
        eng = c(78,88,68,88,99)) #데이터 개수 동일
df2_3

#| 함수와 패키지 #
#c()함수| 쉼표: 불연속 / 콜론: 연속
a<-c(1,3,5,7)
a
b<-c(2,4,6,9)
b
c<-c(1:4)
c
d <- c("단군왕검","주몽","왕건","이성계")
d
#seq()함수| 연속데이터 생성
a<-seq(1,10)
a
b<-seq(1,10,by=2)
b
c<-seq(0,10,by=2)
c
d<-seq(2,10,by=2)
d
